import React from 'react';
import { useLoaderData } from 'react-router-dom';

const AccessDetails = () => {
    const accessData = useLoaderData()
    const { name } = accessData
    return (
        <div className=' mt-2'>
            <h2 className='text-center'> Welcome To {name} Course</h2>
            <p> <span className='text-success'>আপনার ইচ্ছাঃ</span> একজন ওয়েব ডেভলপার হতে হলে প্রচুর ইচ্ছা শক্তি থাকতে হবে। সেই সাথে কাজের সাথে লেগে থাকার মানসিকতা লাগবে।</p>
            <p><span className='text-success'>আপনার সময়ঃ</span>শেখা এবং প্রাক্টিসের জন্য আপনার হাতে পর্যাপ্ত সময় থাকতে হবে। কাজ করতে বসলেন ঐ সময় কোন চুমকির মেসেজে আপনার ফোনটি টুং করে উঠল আর আপনি মেসেঞ্জারে ব্যাস্ত হয়ে গেলেন বা পাশের বাড়ীর ভাবির বিড়াল ছানাকে দেখতে গেলেন। তাহলে হবে না ভাই। আপনাকে লেগে থাকতে হবে। দৈনিক ৬/৮ ঘন্টা কাজ করার মানসিকতা থাকতে হবে।</p>
            <p>আপনার ইচ্ছা ও সময় যদি থাকে তাহলে আজ থেকেই লেগে পড়ুন ওয়েব ডেভলপার হবার মিশনে। এই মিশনে আপনার প্রথম কাজ হবে গুগল মামা ও ইউটিউব এ সার্চ করে দেখুন এবং ওয়েব ডেভলপমেন্ট সম্পর্কে বিশদ ধারনা অর্জন করুন। এই সব করার পর যদি আপনার কোডিং এর প্রতি ভালোবাসা জন্মায় তাহলে আপনি ঝাপিয়ে পড়ুন।</p>
            <h3>আপনার সুবিধার জন্য নিচে কিছু ওয়েব সাইটের নাম দিচ্ছি। এছাড়াও গুগল, ইউটিউব তো আছেই। আবার আপনি চাইলে কোন কোর্সও করতে পারেন</h3>
            <h1>1.Anisul Islam</h1>
            <h1>2.Coders foundation</h1>
            <h1>3.Stack Learner</h1>
            <h2>আপনার ডেভলপমেন্ট জার্নি সফল হোক। আপনার জন্য অনেক অনেক শুভ কামনা।</h2>
        </div>
    );
};

export default AccessDetails;